nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_clock.h
    kCLOCK_Dma1         = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 1U),  /*!< Clock gate name: Dma1. */
    kCLOCK_Comp         = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 2U),  /*!< Clock gate name: Comp. */
    kCLOCK_Freqme       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 8U),  /*!< Clock gate name: Freqme. */
    kCLOCK_Cdog         = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 11U), /*!< Clock gate name: Cdog. */
    kCLOCK_Rng          = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 13U), /*!< Clock gate name: Rng. */
    kCLOCK_Pmux1        = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 14U), /*!< Clock gate name: Pmux1. */
    kCLOCK_Sysctl       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 15U), /*!< Clock gate name: Sysctl. */
    kCLOCK_Usbhmr0      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 16U), /*!< Clock gate name: Usbhmr0. */
    kCLOCK_Usbhsl0      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 17U), /*!< Clock gate name: Usbhsl0. */
    kCLOCK_Css          = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 18U), /*!< Clock gate name: Css. */
    kCLOCK_PowerQuad    = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 19U), /*!< Clock gate name: PowerQuad. */
    kCLOCK_Timer3       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 21U), /*!< Clock gate name: Timer3. */
    kCLOCK_Timer4       = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 22U), /*!< Clock gate name: Timer4. */
    kCLOCK_Puf          = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 23U), /*!< Clock gate name: Puf. */
    kCLOCK_Pkc          = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 24U), /*!< Clock gate name: Pkc. */
    kCLOCK_AnalogCtrl   = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 27U), /*!< Clock gate name: AnalogCtrl. */
    kCLOCK_Hs_Lspi      = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 28U), /*!< Clock gate name: Lspi. */
    kCLOCK_Gpio_Sec     = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 29U), /*!< Clock gate name: Sec. */
    kCLOCK_Gpio_Sec_Int = CLK_GATE_DEFINE(AHB_CLK_CTRL2, 30U), /*!< Clock gate name: Int. */
    kCLOCK_I3c0         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 0U),  /*!< Clock gate name: I3c0. */
    kCLOCK_Enc0         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 3U),  /*!< Clock gate name: Enc0. */
    kCLOCK_Enc1         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 4U),  /*!< Clock gate name: Enc1. */
    kCLOCK_Pwm0         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 5U),  /*!< Clock gate name: Pwm0. */
    kCLOCK_Pwm1         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 6U),  /*!< Clock gate name: Pwm1. */
    kCLOCK_Aoi0         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 7U),  /*!< Clock gate name: Aoi0. */
    kCLOCK_Aoi1         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 8U),  /*!< Clock gate name: Aoi1. */
    kCLOCK_Ftm0         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 9U),  /*!< Clock gate name: Ftm0. */
    kCLOCK_Dac1         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 10U), /*!< Clock gate name: Dac1. */
    kCLOCK_Dac2         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 11U), /*!< Clock gate name: Dac2. */
    kCLOCK_Opamp0       = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 12U), /*!< Clock gate name: Opamp0. */
    kCLOCK_Opamp1       = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 13U), /*!< Clock gate name: Opamp1. */
    kCLOCK_Opamp2       = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 14U), /*!< Clock gate name: Opamp2. */
    kCLOCK_Hscmp0       = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 15U), /*!< Clock gate name: Hscmp0. */
    kCLOCK_Hscmp1       = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 16U), /*!< Clock gate name: Hscmp1. */
    kCLOCK_Hscmp2       = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 17U), /*!< Clock gate name: Hscmp2. */
    kCLOCK_Vref         = CLK_GATE_DEFINE(AHB_CLK_CTRL3, 18U), /*!< Clock gate name: Vref. */

    kCLOCK_Pwm0_Sm0 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 0U),     /*!< Clock gate name: PWM0 SM0. */
    kCLOCK_Pwm0_Sm1 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 1U),     /*!< Clock gate name: PWM0 SM1. */
    kCLOCK_Pwm0_Sm2 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 2U),     /*!< Clock gate name: PWM0 SM2. */
    kCLOCK_Pwm0_Sm3 = CLK_GATE_DEFINE(REG_PWM0SUBCTL, 3U),     /*!< Clock gate name: PWM0 SM3. */

    kCLOCK_Pwm1_Sm0 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 0U),     /*!< Clock gate name: PWM1 SM0. */
    kCLOCK_Pwm1_Sm1 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 1U),     /*!< Clock gate name: PWM1 SM1. */
    kCLOCK_Pwm1_Sm2 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 2U),     /*!< Clock gate name: PWM1 SM2. */
    kCLOCK_Pwm1_Sm3 = CLK_GATE_DEFINE(REG_PWM1SUBCTL, 3U)      /*!< Clock gate name: PWM1 SM3. */

} clock_ip_name_t;

/*! @brief Peripherals clock source definition. */
#define BUS_CLK kCLOCK_BusClk

#define I2C0_CLK_SRC BUS_CLK

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_CoreSysClk, /*!< Core/system clock  (aka MAIN_CLK)                       */
    kCLOCK_BusClk,     /*!< Bus clock (AHB clock)                                   */
    kCLOCK_ClockOut,   /*!< CLOCKOUT                                                */
    kCLOCK_FroHf,      /*!< FRO48/96                                                */
    kCLOCK_Pll1Out,    /*!< PLL1 Output                                             */
    kCLOCK_Mclk,       /*!< MCLK                                                    */
    kCLOCK_Fro12M,     /*!< FRO12M                                                  */
    kCLOCK_Fro1M,      /*!< FRO1M                                                   */
    kCLOCK_ExtClk,     /*!< External Clock                                          */
    kCLOCK_Pll0Out,    /*!< PLL0 Output                                             */
    kCLOCK_PllClkDiv,  /*!< PLLCLKDIV clock                                         */
    kCLOCK_FlexI2S,    /*!< FlexI2S clock                                           */
} clock_name_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

#define CLK_ATTACH_ID(mux, sel, pos) \
    ((((uint32_t)(mux) << 0U) | (((uint32_t)(sel) + 1U) & 0xFU) << 12U) << ((uint32_t)(pos)*16U))
#define MUX_A(mux, sel)           CLK_ATTACH_ID((mux), (sel), 0U)
#define MUX_B(mux, sel, selector) (CLK_ATTACH_ID((mux), (sel), 1U) | ((selector) << 24U))

#define GET_ID_ITEM(connection)      ((connection)&0xFFFFU)
#define GET_ID_NEXT_ITEM(connection) ((connection) >> 16U)
#define GET_ID_ITEM_MUX(connection)  (((uint16_t)connection) & 0xFFFU)
#define GET_ID_ITEM_SEL(connection)  ((uint8_t)((((uint32_t)(connection)&0xF000U) >> 12U) - 1U))
#define GET_ID_SELECTOR(connection)  ((connection)&0xF000000U)

#define CM_SYSTICKCLKSEL0 (0)
#define CM_TRACECLKSEL    (2)
#define CM_CTIMERCLKSEL0  (3)
#define CM_CTIMERCLKSEL1  (4)
#define CM_CTIMERCLKSEL2  (5)
#define CM_CTIMERCLKSEL3  (6)
#define CM_CTIMERCLKSEL4  (7)
#define CM_MAINCLKSELA    (8)
#define CM_MAINCLKSELB    (9)
#define CM_CLKOUTCLKSEL   (10)
#define CM_PLL0CLKSEL     (12)
#define CM_PLL1CLKSEL     (13)
#define CM_MCANCLKSEL     (16)
#define CM_ADC0CLKSEL     (17)
#define CM_USB0CLKSEL     (18)
#define CM_FXCOMCLKSEL0   (20)
#define CM_FXCOMCLKSEL1   (21)
#define CM_FXCOMCLKSEL2   (22)
#define CM_FXCOMCLKSEL3   (23)
#define CM_FXCOMCLKSEL4   (24)
#define CM_FXCOMCLKSEL5   (25)
#define CM_FXCOMCLKSEL6   (26)
#define CM_FXCOMCLKSEL7   (27)
#define CM_HSLSPICLKSEL   (28)
#define CM_MCLKCLKSEL     (32)
#define CM_SCTCLKSEL      (36)

#define CM_ADC1CLKSEL    ((0x464 - 0x260) / 4)
#define CM_DAC0CLKSEL    ((0x490 - 0x260) / 4)
#define CM_DAC1CLKSEL    ((0x498 - 0x260) / 4)
#define CM_DAC2CLKSEL    ((0x4A0 - 0x260) / 4)
#define CM_FLEXSPICLKSEL ((0x4A8 - 0x260) / 4)
#define CM_PLLCLKDIVSEL  ((0x52C - 0x260) / 4)
#define CM_I3CFCLKSEL    ((0x530 - 0x260) / 4)
#define CM_I3CFCLKSTCSEL ((0x534 - 0x260) / 4)
#define CM_I3CFCLKSSEL   ((0x534 - 0x260) / 4)
#define CM_DMICFCLKSEL   ((0x548 - 0x260) / 4)
#define CM_FC32KCLKSEL   ((0x82C - 0x260) / 4)
#define CM_FRGCLKSEL0    ((0x830 - 0x260) / 4)
#define CM_FRGCLKSEL1    ((0x834 - 0x260) / 4)
#define CM_FRGCLKSEL2    ((0x838 - 0x260) / 4)
#define CM_FRGCLKSEL3    ((0x83C - 0x260) / 4)
#define CM_FRGCLKSEL4    ((0x840 - 0x260) / 4)
#define CM_FRGCLKSEL5    ((0x844 - 0x260) / 4)
#define CM_FRGCLKSEL6    ((0x848 - 0x260) / 4)
#define CM_FRGCLKSEL7    ((0x84C - 0x260) / 4)

