nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_clock.h
#define CM_OSTIMERCLKSEL   (252U)
#define CM_RTCOSC32KCLKSEL (253U)

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{

    kFRO12M_to_MAIN_CLK  = MUX_A(CM_MAINCLKSELA, 0) | MUX_B(CM_MAINCLKSELB, 0, 0), /*!< Attach FRO12M to MAIN_CLK. */
    kEXT_CLK_to_MAIN_CLK = MUX_A(CM_MAINCLKSELA, 1) | MUX_B(CM_MAINCLKSELB, 0, 0), /*!< Attach EXT_CLK to MAIN_CLK. */
    kFRO1M_to_MAIN_CLK   = MUX_A(CM_MAINCLKSELA, 2) | MUX_B(CM_MAINCLKSELB, 0, 0), /*!< Attach FRO1M to MAIN_CLK. */
    kFRO_HF_to_MAIN_CLK  = MUX_A(CM_MAINCLKSELA, 3) | MUX_B(CM_MAINCLKSELB, 0, 0), /*!< Attach FRO_HF to MAIN_CLK. */
    kPLL0_to_MAIN_CLK    = MUX_A(CM_MAINCLKSELA, 0) | MUX_B(CM_MAINCLKSELB, 1, 0), /*!< Attach PLL0 to MAIN_CLK. */
    kPLL1_to_MAIN_CLK    = MUX_A(CM_MAINCLKSELA, 0) | MUX_B(CM_MAINCLKSELB, 2, 0), /*!< Attach PLL1 to MAIN_CLK. */
    kOSC32K_to_MAIN_CLK  = MUX_A(CM_MAINCLKSELA, 0) | MUX_B(CM_MAINCLKSELB, 3, 0), /*!< Attach OSC32K to MAIN_CLK. */

    kSYSTICK_DIV_to_SYSTICK0 = MUX_A(CM_SYSTICKCLKSEL0, 0),  /*!< Attach SYSTICK_DIV to SYSTICK0. */
    kFRO1M_to_SYSTICK0       = MUX_A(CM_SYSTICKCLKSEL0, 1),  /*!< Attach FRO1M to SYSTICK0. */
    kOSC32K_to_SYSTICK0      = MUX_A(CM_SYSTICKCLKSEL0, 2),  /*!< Attach OSC32K to SYSTICK0. */
    kNONE_to_SYSTICK0        = MUX_A(CM_SYSTICKCLKSEL0, 7),  /*!< Attach NONE to SYSTICK0. */

    kTRACE_DIV_to_TRACE = MUX_A(CM_TRACECLKSEL, 0),          /*!< Attach TRACE_DIV to TRACE. */
    kFRO1M_to_TRACE     = MUX_A(CM_TRACECLKSEL, 1),          /*!< Attach FRO1M to TRACE. */
    kOSC32K_to_TRACE    = MUX_A(CM_TRACECLKSEL, 2),          /*!< Attach OSC32K to TRACE. */
    kNONE_to_TRACE      = MUX_A(CM_TRACECLKSEL, 7),          /*!< Attach NONE to TRACE. */

    kMAIN_CLK_to_CTIMER0 = MUX_A(CM_CTIMERCLKSEL0, 0),       /*!< Attach MAIN_CLK to CTIMER0. */
    kPLL0_to_CTIMER0     = MUX_A(CM_CTIMERCLKSEL0, 1),       /*!< Attach PLL0 to CTIMER0. */
    kPLL1_to_CTIMER0     = MUX_A(CM_CTIMERCLKSEL0, 2),       /*!< Attach PLL1 to CTIMER0. */
    kFRO_HF_to_CTIMER0   = MUX_A(CM_CTIMERCLKSEL0, 3),       /*!< Attach FRO_HF to CTIMER0. */
    kFRO1M_to_CTIMER0    = MUX_A(CM_CTIMERCLKSEL0, 4),       /*!< Attach FRO1M to CTIMER0. */
    kMCLK_IN_to_CTIMER0  = MUX_A(CM_CTIMERCLKSEL0, 5),
    kOSC32K_to_CTIMER0   = MUX_A(CM_CTIMERCLKSEL0, 6),       /*!< Attach OSC32K to CTIMER0. */
    kNONE_to_CTIMER0     = MUX_A(CM_CTIMERCLKSEL0, 7),       /*!< Attach NONE to CTIMER0. */

    kMAIN_CLK_to_CTIMER1 = MUX_A(CM_CTIMERCLKSEL1, 0),       /*!< Attach MAIN_CLK to CTIMER1. */
    kPLL0_to_CTIMER1     = MUX_A(CM_CTIMERCLKSEL1, 1),       /*!< Attach PLL0 to CTIMER1. */
    kPLL1_to_CTIMER1     = MUX_A(CM_CTIMERCLKSEL1, 2),       /*!< Attach PLL1 to CTIMER1. */
    kFRO_HF_to_CTIMER1   = MUX_A(CM_CTIMERCLKSEL1, 3),       /*!< Attach FRO_HF to CTIMER1. */
    kFRO1M_to_CTIMER1    = MUX_A(CM_CTIMERCLKSEL1, 4),       /*!< Attach FRO1M to CTIMER1. */
    kMCLK_IN_to_CTIMER1  = MUX_A(CM_CTIMERCLKSEL1, 5),       /*!< Attach MCLK_IN to CTIMER1. */
    kOSC32K_to_CTIMER1   = MUX_A(CM_CTIMERCLKSEL1, 6),       /*!< Attach OSC32K to CTIMER1. */
    kNONE_to_CTIMER1     = MUX_A(CM_CTIMERCLKSEL1, 7),       /*!< Attach NONE to CTIMER1. */

    kMAIN_CLK_to_CTIMER2 = MUX_A(CM_CTIMERCLKSEL2, 0),       /*!< Attach MAIN_CLK to CTIMER2. */
    kPLL0_to_CTIMER2     = MUX_A(CM_CTIMERCLKSEL2, 1),       /*!< Attach PLL0 to CTIMER2. */
    kPLL1_to_CTIMER2     = MUX_A(CM_CTIMERCLKSEL2, 2),       /*!< Attach PLL1 to CTIMER2. */
    kFRO_HF_to_CTIMER2   = MUX_A(CM_CTIMERCLKSEL2, 3),       /*!< Attach FRO_HF to CTIMER2. */
    kFRO1M_to_CTIMER2    = MUX_A(CM_CTIMERCLKSEL2, 4),       /*!< Attach FRO1M to CTIMER2. */
    kMCLK_IN_to_CTIMER2  = MUX_A(CM_CTIMERCLKSEL2, 5),       /*!< Attach MCLK_IN to CTIMER2. */
    kOSC32K_to_CTIMER2   = MUX_A(CM_CTIMERCLKSEL2, 6),       /*!< Attach OSC32K to CTIMER2. */
    kNONE_to_CTIMER2     = MUX_A(CM_CTIMERCLKSEL2, 7),       /*!< Attach NONE to CTIMER2. */

    kMAIN_CLK_to_CTIMER3 = MUX_A(CM_CTIMERCLKSEL3, 0),       /*!< Attach MAIN_CLK to CTIMER3. */
    kPLL0_to_CTIMER3     = MUX_A(CM_CTIMERCLKSEL3, 1),       /*!< Attach PLL0 to CTIMER3. */
    kPLL1_to_CTIMER3     = MUX_A(CM_CTIMERCLKSEL3, 2),       /*!< Attach PLL1 to CTIMER3. */
    kFRO_HF_to_CTIMER3   = MUX_A(CM_CTIMERCLKSEL3, 3),       /*!< Attach FRO_HF to CTIMER3. */
    kFRO1M_to_CTIMER3    = MUX_A(CM_CTIMERCLKSEL3, 4),       /*!< Attach FRO1M to CTIMER3. */
    kMCLK_IN_to_CTIMER3  = MUX_A(CM_CTIMERCLKSEL3, 5),       /*!< Attach MCLK_IN to CTIMER3. */
    kOSC32K_to_CTIMER3   = MUX_A(CM_CTIMERCLKSEL3, 6),       /*!< Attach OSC32K to CTIMER3. */
    kNONE_to_CTIMER3     = MUX_A(CM_CTIMERCLKSEL3, 7),       /*!< Attach NONE to CTIMER3. */

    kMAIN_CLK_to_CTIMER4 = MUX_A(CM_CTIMERCLKSEL4, 0),       /*!< Attach MAIN_CLK to CTIMER4. */
    kPLL0_to_CTIMER4     = MUX_A(CM_CTIMERCLKSEL4, 1),       /*!< Attach PLL0 to CTIMER4. */
    kPLL1_to_CTIMER4     = MUX_A(CM_CTIMERCLKSEL4, 2),       /*!< Attach PLL1 to CTIMER4. */
    kFRO_HF_to_CTIMER4   = MUX_A(CM_CTIMERCLKSEL4, 3),       /*!< Attach FRO_HF to CTIMER4. */
    kFRO1M_to_CTIMER4    = MUX_A(CM_CTIMERCLKSEL4, 4),       /*!< Attach FRO1M to CTIMER4. */
    kMCLK_IN_to_CTIMER4  = MUX_A(CM_CTIMERCLKSEL4, 5),       /*!< Attach MCLK_IN to CTIMER4. */
    kOSC32K_to_CTIMER4   = MUX_A(CM_CTIMERCLKSEL4, 6),       /*!< Attach OSC32K to CTIMER4. */
    kNONE_to_CTIMER4     = MUX_A(CM_CTIMERCLKSEL4, 7),       /*!< Attach NONE to CTIMER4. */

    kMAIN_CLK_to_CLKOUT = MUX_A(CM_CLKOUTCLKSEL, 0),         /*!< Attach MAIN_CLK to CLKOUT. */
    kPLL0_to_CLKOUT     = MUX_A(CM_CLKOUTCLKSEL, 1),         /*!< Attach PLL0 to CLKOUT. */
    kEXT_CLK_to_CLKOUT  = MUX_A(CM_CLKOUTCLKSEL, 2),         /*!< Attach EXT_CLK to CLKOUT. */
    kFRO_HF_to_CLKOUT   = MUX_A(CM_CLKOUTCLKSEL, 3),         /*!< Attach FRO_HF to CLKOUT. */
    kFRO1M_to_CLKOUT    = MUX_A(CM_CLKOUTCLKSEL, 4),         /*!< Attach FRO1M to CLKOUT. */
    kPLL1_to_CLKOUT     = MUX_A(CM_CLKOUTCLKSEL, 5),         /*!< Attach PLL1 to CLKOUT. */
    kOSC32K_to_CLKOUT   = MUX_A(CM_CLKOUTCLKSEL, 6),         /*!< Attach OSC32K to CLKOUT. */
    kNONE_to_CLKOUT     = MUX_A(CM_CLKOUTCLKSEL, 7),         /*!< Attach NONE to CLKOUT. */

    kFRO12M_to_PLL0  = MUX_A(CM_PLL0CLKSEL, 0),              /*!< Attach FRO12M to PLL0. */
    kEXT_CLK_to_PLL0 = MUX_A(CM_PLL0CLKSEL, 1),              /*!< Attach EXT_CLK to PLL0. */
    kFRO1M_to_PLL0   = MUX_A(CM_PLL0CLKSEL, 2),              /*!< Attach FRO1M to PLL0. */
    kOSC32K_to_PLL0  = MUX_A(CM_PLL0CLKSEL, 3),              /*!< Attach OSC32K to PLL0. */
    kNONE_to_PLL0    = MUX_A(CM_PLL0CLKSEL, 7),              /*!< Attach NONE to PLL0. */

    kFRO12M_to_PLL1  = MUX_A(CM_PLL1CLKSEL, 0),              /*!< Attach FRO12M to PLL1. */
    kEXT_CLK_to_PLL1 = MUX_A(CM_PLL1CLKSEL, 1),              /*!< Attach EXT_CLK to PLL1. */
    kFRO1M_to_PLL1   = MUX_A(CM_PLL1CLKSEL, 2),              /*!< Attach FRO1M to PLL1. */
    kOSC32K_to_PLL1  = MUX_A(CM_PLL1CLKSEL, 3),              /*!< Attach OSC32K to PLL1. */
    kNONE_to_PLL1    = MUX_A(CM_PLL1CLKSEL, 7),              /*!< Attach NONE to PLL1. */

    kMCAN_DIV_to_MCAN = MUX_A(CM_MCANCLKSEL, 0),             /*!< Attach MCAN_DIV to MCAN. */
    kFRO1M_to_MCAN    = MUX_A(CM_MCANCLKSEL, 1),             /*!< Attach FRO1M to MCAN. */
    kOSC32K_to_MCAN   = MUX_A(CM_MCANCLKSEL, 2),             /*!< Attach OSC32K to MCAN. */
    kNONE_to_MCAN     = MUX_A(CM_MCANCLKSEL, 7),             /*!< Attach NONE to MCAN. */

