nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_clock.h
    kMAIN_CLK_to_ADC0 = MUX_A(CM_ADC0CLKSEL, 0),             /*!< Attach MAIN_CLK to ADC0. */
    kPLL0_to_ADC0     = MUX_A(CM_ADC0CLKSEL, 1),             /*!< Attach PLL0 to ADC0. */
    kFRO_HF_to_ADC0   = MUX_A(CM_ADC0CLKSEL, 2),             /*!< Attach FRO_HF to ADC0. */
    kEXT_CLK_to_ADC0  = MUX_A(CM_ADC0CLKSEL, 4),             /*!< Attach XO to ADC0. */
    kNONE_to_ADC0     = MUX_A(CM_ADC0CLKSEL, 7),             /*!< Attach NONE to ADC0. */

    kMAIN_CLK_to_ADC1 = MUX_A(CM_ADC1CLKSEL, 0),             /*!< Attach MAIN_CLK to ADC1. */
    kPLL0_to_ADC1     = MUX_A(CM_ADC1CLKSEL, 1),             /*!< Attach PLL0 to ADC1. */
    kFRO_HF_to_ADC1   = MUX_A(CM_ADC1CLKSEL, 2),             /*!< Attach FRO_HF to ADC1. */
    kEXT_CLK_to_ADC1  = MUX_A(CM_ADC1CLKSEL, 4),             /*!< Attach XO to ADC1. */
    kNONE_to_ADC1     = MUX_A(CM_ADC1CLKSEL, 7),             /*!< Attach NONE to ADC1. */

    kMAIN_CLK_to_USB0 = MUX_A(CM_USB0CLKSEL, 0),             /*!< Attach MAIN_CLK to USB0. */
    kPLL0_to_USB0     = MUX_A(CM_USB0CLKSEL, 1),             /*!< Attach PLL0 to USB0. */
    kFRO_HF_to_USB0   = MUX_A(CM_USB0CLKSEL, 3),             /*!< Attach FRO_HF to USB0. */
    kPLL1_to_USB0     = MUX_A(CM_USB0CLKSEL, 5),             /*!< Attach PLL1 to USB0. */
    kNONE_to_USB0     = MUX_A(CM_USB0CLKSEL, 7),             /*!< Attach NONE to USB0. */

    kMAIN_CLK_to_FLEXCOMM0      = MUX_A(CM_FXCOMCLKSEL0, 0), /*!< Attach MAIN_CLK to FLEXCOMM0. */
    kMAIN_CLK_FRG0_to_FLEXCOMM0 = MUX_A(CM_FXCOMCLKSEL0, 1) | MUX_B(CM_FRGCLKSEL0, 0, 0),    /*!< Attach Main clock
                                                                                                     to FlexComm0. */
    kPLL_CLK_DIV_FRG0_to_FLEXCOMM0 = MUX_A(CM_FXCOMCLKSEL0, 1) | MUX_B(CM_FRGCLKSEL0, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm0. */
    kFRO_HF_DIV_FRG0_to_FLEXCOMM0 = MUX_A(CM_FXCOMCLKSEL0, 1) | MUX_B(CM_FRGCLKSEL0, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm0. */
    kFRO12M_to_FLEXCOMM0     = MUX_A(CM_FXCOMCLKSEL0, 2),    /*!< Attach FRO12M to FLEXCOMM0. */
    kFRO_HF_DIV_to_FLEXCOMM0 = MUX_A(CM_FXCOMCLKSEL0, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM0. */
    kFRO1M_to_FLEXCOMM0      = MUX_A(CM_FXCOMCLKSEL0, 4),    /*!< Attach FRO1M to FLEXCOMM0. */
    kMCLK_IN_to_FLEXCOMM0    = MUX_A(CM_FXCOMCLKSEL0, 5),    /*!< Attach MCLK_IN to FLEXCOMM0. */
    kOSC32K_to_FLEXCOMM0     = MUX_A(CM_FXCOMCLKSEL0, 6),    /*!< Attach OSC32K to FLEXCOMM0. */
    kNONE_to_FLEXCOMM0       = MUX_A(CM_FXCOMCLKSEL0, 7),    /*!< Attach NONE to FLEXCOMM0. */

    kMAIN_CLK_to_FLEXCOMM1      = MUX_A(CM_FXCOMCLKSEL1, 0), /*!< Attach MAIN_CLK to FLEXCOMM1. */
    kMAIN_CLK_FRG1_to_FLEXCOMM1 = MUX_A(CM_FXCOMCLKSEL1, 1) | MUX_B(CM_FRGCLKSEL1, 0, 0),    /*!< Attach Main clock
                                                                                                     to FlexComm1. */
    kPLL_CLK_DIV_FRG1_to_FLEXCOMM1 = MUX_A(CM_FXCOMCLKSEL1, 1) | MUX_B(CM_FRGCLKSEL1, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm1. */
    kFRO_HF_DIV_FRG1_to_FLEXCOMM1 = MUX_A(CM_FXCOMCLKSEL1, 1) | MUX_B(CM_FRGCLKSEL1, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm1. */
    kFRO12M_to_FLEXCOMM1     = MUX_A(CM_FXCOMCLKSEL1, 2),    /*!< Attach FRO12M to FLEXCOMM1. */
    kFRO_HF_DIV_to_FLEXCOMM1 = MUX_A(CM_FXCOMCLKSEL1, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM1. */
    kFRO1M_to_FLEXCOMM1      = MUX_A(CM_FXCOMCLKSEL1, 4),    /*!< Attach FRO1M to FLEXCOMM1. */
    kMCLK_IN_to_FLEXCOMM1    = MUX_A(CM_FXCOMCLKSEL1, 5),    /*!< Attach MCLK_IN to FLEXCOMM1. */
    kOSC32K_to_FLEXCOMM1     = MUX_A(CM_FXCOMCLKSEL1, 6),    /*!< Attach OSC32K to FLEXCOMM1. */
    kNONE_to_FLEXCOMM1       = MUX_A(CM_FXCOMCLKSEL1, 7),    /*!< Attach NONE to FLEXCOMM1. */

    kMAIN_CLK_to_FLEXCOMM2      = MUX_A(CM_FXCOMCLKSEL2, 0), /*!< Attach MAIN_CLK to FLEXCOMM2. */
    kMAIN_CLK_FRG2_to_FLEXCOMM2 = MUX_A(CM_FXCOMCLKSEL2, 1) | MUX_B(CM_FRGCLKSEL2, 0, 0),    /*!< Attach Main clock
                                                                                                     to FlexComm2. */
    kPLL_CLK_DIV_FRG2_to_FLEXCOMM2 = MUX_A(CM_FXCOMCLKSEL2, 1) | MUX_B(CM_FRGCLKSEL2, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm2. */
    kFRO_HF_DIV_FRG2_to_FLEXCOMM2 = MUX_A(CM_FXCOMCLKSEL2, 1) | MUX_B(CM_FRGCLKSEL2, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm2. */
    kFRO12M_to_FLEXCOMM2     = MUX_A(CM_FXCOMCLKSEL2, 2),    /*!< Attach FRO12M to FLEXCOMM2. */
    kFRO_HF_DIV_to_FLEXCOMM2 = MUX_A(CM_FXCOMCLKSEL2, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM2. */
    kFRO1M_to_FLEXCOMM2      = MUX_A(CM_FXCOMCLKSEL2, 4),    /*!< Attach FRO1M to FLEXCOMM2. */
    kMCLK_IN_to_FLEXCOMM2    = MUX_A(CM_FXCOMCLKSEL2, 5),    /*!< Attach MCLK_IN to FLEXCOMM2. */
    kOSC32K_to_FLEXCOMM2     = MUX_A(CM_FXCOMCLKSEL2, 6),    /*!< Attach OSC32K to FLEXCOMM2. */
    kNONE_to_FLEXCOMM2       = MUX_A(CM_FXCOMCLKSEL2, 7),    /*!< Attach NONE to FLEXCOMM2. */

    kMAIN_CLK_to_FLEXCOMM3      = MUX_A(CM_FXCOMCLKSEL3, 0), /*!< Attach MAIN_CLK to FLEXCOMM3. */
    kMAIN_CLK_FRG3_to_FLEXCOMM3 = MUX_A(CM_FXCOMCLKSEL3, 1) | MUX_B(CM_FRGCLKSEL3, 0, 0),    /*!< Attach Main clock
                                                                                                     to FlexComm3. */
    kPLL_CLK_DIV_FRG3_to_FLEXCOMM3 = MUX_A(CM_FXCOMCLKSEL3, 1) | MUX_B(CM_FRGCLKSEL3, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm3. */
    kFRO_HF_DIV_FRG3_to_FLEXCOMM3 = MUX_A(CM_FXCOMCLKSEL3, 1) | MUX_B(CM_FRGCLKSEL3, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm3. */
    kFRO12M_to_FLEXCOMM3     = MUX_A(CM_FXCOMCLKSEL3, 2),    /*!< Attach FRO12M to FLEXCOMM3. */
    kFRO_HF_DIV_to_FLEXCOMM3 = MUX_A(CM_FXCOMCLKSEL3, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM3. */
    kFRO1M_to_FLEXCOMM3      = MUX_A(CM_FXCOMCLKSEL3, 4),    /*!< Attach FRO1M to FLEXCOMM3. */
    kMCLK_IN_to_FLEXCOMM3    = MUX_A(CM_FXCOMCLKSEL3, 5),    /*!< Attach MCLK_IN to FLEXCOMM3. */
    kOSC32K_to_FLEXCOMM3     = MUX_A(CM_FXCOMCLKSEL3, 6),    /*!< Attach OSC32K to FLEXCOMM3. */
    kNONE_to_FLEXCOMM3       = MUX_A(CM_FXCOMCLKSEL3, 7),    /*!< Attach NONE to FLEXCOMM3. */

