nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_clock.h
    kMAIN_CLK_to_FLEXCOMM4      = MUX_A(CM_FXCOMCLKSEL4, 0), /*!< Attach MAIN_CLK to FLEXCOMM4. */
    kMAIN_CLK_FRG4_to_FLEXCOMM4 = MUX_A(CM_FXCOMCLKSEL4, 1) | MUX_B(CM_FRGCLKSEL4, 0, 0),    /*!< Attach Main clock
                                                                                                     to FlexComm4. */
    kPLL_CLK_DIV_FRG4_to_FLEXCOMM4 = MUX_A(CM_FXCOMCLKSEL4, 1) | MUX_B(CM_FRGCLKSEL4, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm4. */
    kFRO_HF_DIV_FRG4_to_FLEXCOMM4 = MUX_A(CM_FXCOMCLKSEL4, 1) | MUX_B(CM_FRGCLKSEL4, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm4. */
    kFRO12M_to_FLEXCOMM4     = MUX_A(CM_FXCOMCLKSEL4, 2),    /*!< Attach FRO12M to FLEXCOMM4. */
    kFRO_HF_DIV_to_FLEXCOMM4 = MUX_A(CM_FXCOMCLKSEL4, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM4. */
    kFRO1M_to_FLEXCOMM4      = MUX_A(CM_FXCOMCLKSEL4, 4),    /*!< Attach FRO1M to FLEXCOMM4. */
    kMCLK_IN_to_FLEXCOMM4    = MUX_A(CM_FXCOMCLKSEL4, 5),    /*!< Attach MCLK_IN to FLEXCOMM4. */
    kOSC32K_to_FLEXCOMM4     = MUX_A(CM_FXCOMCLKSEL4, 6),    /*!< Attach OSC32K to FLEXCOMM4. */
    kNONE_to_FLEXCOMM4       = MUX_A(CM_FXCOMCLKSEL4, 7),    /*!< Attach NONE to FLEXCOMM4. */

    kMAIN_CLK_to_FLEXCOMM5      = MUX_A(CM_FXCOMCLKSEL5, 0), /*!< Attach MAIN_CLK to FLEXCOMM5. */
    kMAIN_CLK_FRG5_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 1) | MUX_B(CM_FRGCLKSEL5, 0, 0),    /*!< Attach Main clock
                                                                                                 to FlexComm5. */
    kPLL_CLK_DIV_FRG5_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 1) | MUX_B(CM_FRGCLKSEL5, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm5. */
    kFRO_HF_DIV_FRG5_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 1) | MUX_B(CM_FRGCLKSEL5, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm5. */
    kFRO12M_to_FLEXCOMM5     = MUX_A(CM_FXCOMCLKSEL5, 2),    /*!< Attach FRO12M to FLEXCOMM5. */
    kFRO_HF_DIV_to_FLEXCOMM5 = MUX_A(CM_FXCOMCLKSEL5, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM5. */
    kFRO1M_to_FLEXCOMM5      = MUX_A(CM_FXCOMCLKSEL5, 4),    /*!< Attach FRO1M to FLEXCOMM5. */
    kMCLK_IN_to_FLEXCOMM5    = MUX_A(CM_FXCOMCLKSEL5, 5),    /*!< Attach MCLK_IN to FLEXCOMM5. */
    kOSC32K_to_FLEXCOMM5     = MUX_A(CM_FXCOMCLKSEL5, 6),    /*!< Attach OSC32K to FLEXCOMM5. */
    kNONE_to_FLEXCOMM5       = MUX_A(CM_FXCOMCLKSEL5, 7),    /*!< Attach NONE to FLEXCOMM5. */

    kMAIN_CLK_to_FLEXCOMM6      = MUX_A(CM_FXCOMCLKSEL6, 0), /*!< Attach MAIN_CLK to FLEXCOMM6. */
    kMAIN_CLK_FRG6_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 1) | MUX_B(CM_FRGCLKSEL6, 0, 0),    /*!< Attach Main clock
                                                                                                 to FlexComm6. */
    kPLL_CLK_DIV_FRG6_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 1) | MUX_B(CM_FRGCLKSEL6, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm6. */
    kFRO_HF_DIV_FRG6_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 1) | MUX_B(CM_FRGCLKSEL6, 2, 0),  /*!< Attach FRO HF DIV
                                                                                                 FRG to FlexComm6. */
    kFRO12M_to_FLEXCOMM6     = MUX_A(CM_FXCOMCLKSEL6, 2),    /*!< Attach FRO12M to FLEXCOMM6. */
    kFRO_HF_DIV_to_FLEXCOMM6 = MUX_A(CM_FXCOMCLKSEL6, 3),    /*!< Attach FRO_HF_DIV to FLEXCOMM6. */
    kFRO1M_to_FLEXCOMM6      = MUX_A(CM_FXCOMCLKSEL6, 4),    /*!< Attach FRO1M to FLEXCOMM6. */
    kMCLK_IN_to_FLEXCOMM6    = MUX_A(CM_FXCOMCLKSEL6, 5),    /*!< Attach MCLK_IN to FLEXCOMM6. */
    kOSC32K_to_FLEXCOMM6     = MUX_A(CM_FXCOMCLKSEL6, 6),    /*!< Attach OSC32K to FLEXCOMM6. */
    kNONE_to_FLEXCOMM6       = MUX_A(CM_FXCOMCLKSEL6, 7),    /*!< Attach NONE to FLEXCOMM6. */

    kMAIN_CLK_to_FLEXCOMM7      = MUX_A(CM_FXCOMCLKSEL7, 0), /*!< Attach MAIN_CLK to FLEXCOMM7. */
    kMAIN_CLK_FRG7_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1) | MUX_B(CM_FRGCLKSEL7, 0, 0),    /*!< Attach Main clock
                                                                                                 to FlexComm7. */
    kPLL_CLK_DIV_FRG7_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1) | MUX_B(CM_FRGCLKSEL7, 1, 0), /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm7. */
    kFRO_HF_DIV_FRG7_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 1) | MUX_B(CM_FRGCLKSEL7, 2, 0),  /*!< Attach PLL clock
                                                                                             DIV Frg to FlexComm7. */
    kFRO12M_to_FLEXCOMM7     = MUX_A(CM_FXCOMCLKSEL7, 2),   /*!< Attach FRO12M to FLEXCOMM7. */
    kFRO_HF_DIV_to_FLEXCOMM7 = MUX_A(CM_FXCOMCLKSEL7, 3),   /*!< Attach FRO_HF_DIV to FLEXCOMM7. */
    kFRO1M_to_FLEXCOMM7      = MUX_A(CM_FXCOMCLKSEL7, 4),   /*!< Attach FRO1M to FLEXCOMM7. */
    kMCLK_IN_to_FLEXCOMM7    = MUX_A(CM_FXCOMCLKSEL7, 5),   /*!< Attach MCLK_IN to FLEXCOMM7. */
    kOSC32K_to_FLEXCOMM7     = MUX_A(CM_FXCOMCLKSEL7, 6),   /*!< Attach OSC32K to FLEXCOMM7. */
    kNONE_to_FLEXCOMM7       = MUX_A(CM_FXCOMCLKSEL7, 7),   /*!< Attach NONE to FLEXCOMM7. */

    kMAIN_CLK_to_HSLSPI    = MUX_A(CM_HSLSPICLKSEL, 0),     /*!< Attach MAIN_CLK to HSLSPI. */
    kPLL_CLK_DIV_to_HSLSPI = MUX_A(CM_HSLSPICLKSEL, 1),     /*!< Attach PLL_CLK_DIV to HSLSPI. */
    kFRO12M_to_HSLSPI      = MUX_A(CM_HSLSPICLKSEL, 2),     /*!< Attach FRO12M to HSLSPI. */
    kFRO_HF_DIV_to_HSLSPI  = MUX_A(CM_HSLSPICLKSEL, 3),     /*!< Attach FRO_HF_DIV to HSLSPI. */
    kFRO1M_to_HSLSPI       = MUX_A(CM_HSLSPICLKSEL, 4),     /*!< Attach FRO1M to HSLSPI. */
    kOSC32K_to_HSLSPI      = MUX_A(CM_HSLSPICLKSEL, 6),     /*!< Attach OSC32K to HSLSPI. */
    kNONE_to_HSLSPI        = MUX_A(CM_HSLSPICLKSEL, 7),     /*!< Attach NONE to HSLSPI. */

    kFRO_HF_to_MCLK = MUX_A(CM_MCLKCLKSEL, 0),              /*!< Attach FRO_HF to MCLK. */
    kPLL0_to_MCLK   = MUX_A(CM_MCLKCLKSEL, 1),              /*!< Attach PLL0 to MCLK. */
    kNONE_to_MCLK   = MUX_A(CM_MCLKCLKSEL, 7),              /*!< Attach NONE to MCLK. */

    kMAIN_CLK_to_SCT = MUX_A(CM_SCTCLKSEL, 0),              /*!< Attach MAIN_CLK to SCT. */
    kPLL0_to_SCT     = MUX_A(CM_SCTCLKSEL, 1),              /*!< Attach PLL0 to SCT. */
    kEXT_CLK_to_SCT  = MUX_A(CM_SCTCLKSEL, 2),              /*!< Attach EXT_CLK to SCT. */
    kFRO_HF_to_SCT   = MUX_A(CM_SCTCLKSEL, 3),              /*!< Attach FRO_HF to SCT. */
    kPLL1_to_SCT     = MUX_A(CM_SCTCLKSEL, 4),              /*!< Attach PLL1 to SCT. */
    kMCLK_IN_to_SCT  = MUX_A(CM_SCTCLKSEL, 5),              /*!< Attach MCLK_IN to SCT. */
    kNONE_to_SCT     = MUX_A(CM_SCTCLKSEL, 7),              /*!< Attach NONE to SCT. */

