nxp-mcuxpresso/mcux-sdk/devices/LPC5534/drivers/fsl_clock.h
    kMAIN_CLK_to_DAC0 = MUX_A(CM_DAC0CLKSEL, 0),            /*!< Attach MAIN_CLK to DAC0. */
    kPLL0_to_DAC0     = MUX_A(CM_DAC0CLKSEL, 1),            /*!< Attach PLL0 to DAC0. */
    kFRO_HF_to_DAC0   = MUX_A(CM_DAC0CLKSEL, 3),            /*!< Attach FRO_HF to DAC0. */
    kFRO12M_to_DAC0   = MUX_A(CM_DAC0CLKSEL, 4),            /*!< Attach FRO12M to DAC0. */
    kPLL1_to_DAC0     = MUX_A(CM_DAC0CLKSEL, 5),            /*!< Attach PLL1 to DAC0. */
    kFRO1M_to_DAC0    = MUX_A(CM_DAC0CLKSEL, 6),            /*!< Attach FRO1M to DAC0. */
    kNONE_to_DAC0     = MUX_A(CM_DAC0CLKSEL, 7),            /*!< Attach NONE to DAC0. */

    kMAIN_CLK_to_DAC1 = MUX_A(CM_DAC1CLKSEL, 0),            /*!< Attach MAIN_CLK to DAC1. */
    kPLL0_to_DAC1     = MUX_A(CM_DAC1CLKSEL, 1),            /*!< Attach PLL0 to DAC1. */
    kFRO_HF_to_DAC1   = MUX_A(CM_DAC1CLKSEL, 3),            /*!< Attach FRO_HF to DAC1. */
    kFRO12M_to_DAC1   = MUX_A(CM_DAC1CLKSEL, 4),            /*!< Attach FRO12M to DAC1. */
    kPLL1_to_DAC1     = MUX_A(CM_DAC1CLKSEL, 5),            /*!< Attach PLL1 to DAC1. */
    kFRO1M_to_DAC1    = MUX_A(CM_DAC1CLKSEL, 6),            /*!< Attach FRO1M to DAC1. */
    kNONE_to_DAC1     = MUX_A(CM_DAC1CLKSEL, 7),            /*!< Attach NONE to DAC1. */

    kMAIN_CLK_to_DAC2 = MUX_A(CM_DAC2CLKSEL, 0),            /*!< Attach MAIN_CLK to DAC2. */
    kPLL0_to_DAC2     = MUX_A(CM_DAC2CLKSEL, 1),            /*!< Attach PLL0 to DAC2. */
    kFRO_HF_to_DAC2   = MUX_A(CM_DAC2CLKSEL, 3),            /*!< Attach FRO_HF to DAC2. */
    kFRO12M_to_DAC2   = MUX_A(CM_DAC2CLKSEL, 4),            /*!< Attach FRO12M to DAC2. */
    kPLL1_to_DAC2     = MUX_A(CM_DAC2CLKSEL, 5),            /*!< Attach PLL1 to DAC2. */
    kFRO1M_to_DAC2    = MUX_A(CM_DAC2CLKSEL, 6),            /*!< Attach FRO1M to DAC2. */
    kNONE_to_DAC2     = MUX_A(CM_DAC2CLKSEL, 7),            /*!< Attach NONE to DAC2. */

    kMAIN_CLK_to_FLEXSPI = MUX_A(CM_FLEXSPICLKSEL, 0),      /*!< Attach MAIN_CLK to FLEXSPI. */
    kPLL0_to_FLEXSPI     = MUX_A(CM_FLEXSPICLKSEL, 1),      /*!< Attach PLL0 to FLEXSPI. */
    kFRO_HF_to_FLEXSPI   = MUX_A(CM_FLEXSPICLKSEL, 3),      /*!< Attach FRO_HF to FLEXSPI. */
    kPLL1_to_FLEXSPI     = MUX_A(CM_FLEXSPICLKSEL, 5),      /*!< Attach PLL1 to FLEXSPI. */
    kNONE_to_FLEXSPI     = MUX_A(CM_FLEXSPICLKSEL, 7),      /*!< Attach NONE to FLEXSPI. */

    kPLL0_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 0),         /*!< Attach PLL0 to PLLCLKDIV. */
    kPLL1_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 1),         /*!< Attach PLL1 to PLLCLKDIV. */
    kNONE_to_PLLCLKDIV = MUX_A(CM_PLLCLKDIVSEL, 7),         /*!< Attach NONE to PLLCLKDIV. */

    kMAIN_CLK_to_I3CFCLK   = MUX_A(CM_I3CFCLKSEL, 0),       /*!< Attach MAIN_CLK to I3CFCLK. */
    kFRO_HF_DIV_to_I3CFCLK = MUX_A(CM_I3CFCLKSEL, 1),       /*!< Attach FRO_HF_DIV to I3CFCLK. */
    kNONE_to_I3CFCLK       = MUX_A(CM_I3CFCLKSEL, 7),       /*!< Attach NONE to I3CFCLK. */

    kI3CFCLKSEL_to_I3CFCLKSTC = MUX_A(CM_I3CFCLKSTCSEL, 0), /*!< Attach I3CFCLKSEL to I3CFCLKSTC. */
    kFRO1M_to_I3CFCLKSTC      = MUX_A(CM_I3CFCLKSTCSEL, 1), /*!< Attach FRO1M to I3CFCLKSTC. */
    kNONE_to_I3CFCLKSTC       = MUX_A(CM_I3CFCLKSTCSEL, 7), /*!< Attach NONE to I3CFCLKSTC. */

    kMAIN_CLK_to_DMIC = MUX_A(CM_DMICFCLKSEL, 0),           /*!< Attach MAIN_CLK to DMIC. */
    kPLL0_to_DMIC     = MUX_A(CM_DMICFCLKSEL, 1),           /*!< Attach PLL0 to DMIC. */
    kEXT_CLK_to_DMIC  = MUX_A(CM_DMICFCLKSEL, 2),           /*!< Attach EXT_CLK to DMIC. */
    kFRO_HF_to_DMIC   = MUX_A(CM_DMICFCLKSEL, 3),           /*!< Attach FRO_HF to DMIC. */
    kPLL1_to_DMIC     = MUX_A(CM_DMICFCLKSEL, 4),           /*!< Attach PLL1 to DMIC. */
    kMCLK_IN_to_DMIC  = MUX_A(CM_DMICFCLKSEL, 5),           /*!< Attach MCLK_IN to DMIC. */
    kNONE_to_DMIC     = MUX_A(CM_DMICFCLKSEL, 7),           /*!< Attach NONE to DMIC. */

    kFRO32K_to_FCOSC32K  = MUX_A(CM_FC32KCLKSEL, 0),        /*!< Attach FRO32K to FCOSC32K. */
    kXTAL32K_to_FCOSC32K = MUX_A(CM_FC32KCLKSEL, 1),        /*!< Attach XTAL32K to FCOSC32K. */
    kFRO32K_to_OSC32K    = MUX_A(CM_RTCOSC32KCLKSEL, 0),    /*!< Attach FRO32K to OSC32K. */
    kXTAL32K_to_OSC32K   = MUX_A(CM_RTCOSC32KCLKSEL, 1),    /*!< Attach XTAL32K to OSC32K. */
    kFRO32K_to_FC32K     = MUX_A(CM_FC32KCLKSEL, 0),        /*!< Attach FRO32K to FC32K. */
    kXTAL32K_to_FC32K    = MUX_A(CM_FC32KCLKSEL, 1),        /*!< Attach XTAL32K to FC32K. */

    kFRO32K_to_OSTIMER  = MUX_A(CM_OSTIMERCLKSEL, 0),       /*!< Attach FRO32K to OSTIMER. */
    kOSC32K_to_OSTIMER  = MUX_A(CM_OSTIMERCLKSEL, 1),       /*!< Attach OSC32K to OSTIMER. */
    kFRO1M_to_OSTIMER   = MUX_A(CM_OSTIMERCLKSEL, 2),       /*!< Attach FRO1M to OSTIMER. */
    kAHB_CLK_to_OSTIMER = MUX_A(CM_OSTIMERCLKSEL, 3),       /*!< Attach AHB_CLK to OSTIMER. */

    kNONE_to_NONE = (int)0x80000000U,                       /*!< Attach NONE to NONE. */

} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
    kCLOCK_DivSystickClk  = (0),                   /*!< Systick Clock Divider. */
    kCLOCK_DivArmTrClkDiv = ((0x308 - 0x300) / 4), /*!< Trace Clock Divider. */
    kCLOCK_DivCanClk      = ((0x30C - 0x300) / 4), /*!< Can Clock Divider. */
    kCLOCK_DivFlexFrg0    = ((0x320 - 0x300) / 4), /*!< FRGCTRL0 register. */
    kCLOCK_DivFlexFrg1    = ((0x324 - 0x300) / 4), /*!< FRGCTRL1 register. */
    kCLOCK_DivFlexFrg2    = ((0x328 - 0x300) / 4), /*!< FRGCTRL2 register. */
    kCLOCK_DivFlexFrg3    = ((0x32C - 0x300) / 4), /*!< FRGCTRL3 register. */
    kCLOCK_DivFlexFrg4    = ((0x330 - 0x300) / 4), /*!< FRGCTRL4 register. */
    kCLOCK_DivFlexFrg5    = ((0x334 - 0x300) / 4), /*!< FRGCTRL5 register. */
    kCLOCK_DivFlexFrg6    = ((0x338 - 0x300) / 4), /*!< FRGCTRL6 register. */
    kCLOCK_DivFlexFrg7    = ((0x33C - 0x300) / 4), /*!< FRGCTRL7 register. */
    kCLOCK_DivAhbClk      = ((0x380 - 0x300) / 4), /*!< Ahb Clock Divider. */
    kCLOCK_DivClkOut      = ((0x384 - 0x300) / 4), /*!< Clk Out Divider. */
    kCLOCK_DivFrohfClk    = ((0x388 - 0x300) / 4), /*!< Frohf Divider. */
    kCLOCK_DivWdtClk      = ((0x38C - 0x300) / 4), /*!< Wdt Clock Divider. */
    kCLOCK_DivAdc0Clk     = ((0x394 - 0x300) / 4), /*!< Adc0 Clock Divider. */
    kCLOCK_DivUsb0Clk     = ((0x398 - 0x300) / 4), /*!< Usb0 Clock Divider. */
    kCLOCK_DivMclk        = ((0x3AC - 0x300) / 4), /*!< Mclk Divider. */
    kCLOCK_DivSctClk      = ((0x3B4 - 0x300) / 4), /*!< Sct Clock Divider. */
    kCLOCK_DivPllClk      = ((0x3C4 - 0x300) / 4), /*!< Pll0 Clock Divider. */
    kCLOCK_DivCtimer0Clk  = ((0x3D0 - 0x300) / 4), /*!< Ctimer0 Clock Divider. */
    kCLOCK_DivCtimer1Clk  = ((0x3D4 - 0x300) / 4), /*!< Ctimer1 Clock Divider. */
    kCLOCK_DivCtimer2Clk  = ((0x3D8 - 0x300) / 4), /*!< Ctimer2 Clock Divider. */
    kCLOCK_DivCtimer3Clk  = ((0x3DC - 0x300) / 4), /*!< Ctimer3 Clock Divider. */
    kCLOCK_DivCtimer4Clk  = ((0x3E0 - 0x300) / 4), /*!< Ctimer4 Clock Divider. */
    kCLOCK_DivAdc1Clk     = ((0x468 - 0x300) / 4), /*!< Adc1 Clock Divider. */
    kCLOCK_DivDac0Clk     = ((0x494 - 0x300) / 4), /*!< Dac0 Clock Divider. */
    kCLOCK_DivDac1Clk     = ((0x49C - 0x300) / 4), /*!< Dac1 Clock Divider. */
    kCLOCK_DivDac2Clk     = ((0x4A4 - 0x300) / 4), /*!< Dac2 Clock Divider. */
    kCLOCK_DivFlexSpiClk  = ((0x4AC - 0x300) / 4), /*!< Flex Spi Clock Divider. */
    kCLOCK_DivI3cFclkStc  = ((0x538 - 0x300) / 4), /*!< I3c Fclk Stc Divider. */
    kCLOCK_DivI3cFclkS    = ((0x53C - 0x300) / 4), /*!< I3c Fclk S Divider. */
    kCLOCK_DivI3cFclk     = ((0x540 - 0x300) / 4), /*!< I3c Fclk Divider. */
    kCLOCK_DivDmicClk     = ((0x54C - 0x300) / 4), /*!< Dmic Clock Divider. */
    kCLOCK_DivFlexcom0Clk = ((0x850 - 0x300) / 4), /*!< Flexcom0 Clock Divider. */
    kCLOCK_DivFlexcom1Clk = ((0x854 - 0x300) / 4), /*!< Flexcom1 Clock Divider. */
    kCLOCK_DivFlexcom2Clk = ((0x858 - 0x300) / 4), /*!< Flexcom2 Clock Divider. */
    kCLOCK_DivFlexcom3Clk = ((0x85C - 0x300) / 4), /*!< Flexcom3 Clock Divider. */
    kCLOCK_DivFlexcom4Clk = ((0x860 - 0x300) / 4), /*!< Flexcom4 Clock Divider. */
    kCLOCK_DivFlexcom5Clk = ((0x864 - 0x300) / 4), /*!< Flexcom5 Clock Divider. */
    kCLOCK_DivFlexcom6Clk = ((0x868 - 0x300) / 4), /*!< Flexcom6 Clock Divider. */
    kCLOCK_DivFlexcom7Clk = ((0x86C - 0x300) / 4), /*!< Flexcom7 Clock Divider. */
} clock_div_name_t;

